zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/pinctrl/esp32s2-pinctrl.h
/**
 * @name PCNT3_CH1CTRL
 * @{
 */
#define PCNT3_CH1CTRL_GPIO0 ESP32_PINMUX(0, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO1 ESP32_PINMUX(1, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO2 ESP32_PINMUX(2, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO3 ESP32_PINMUX(3, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO4 ESP32_PINMUX(4, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO5 ESP32_PINMUX(5, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO6 ESP32_PINMUX(6, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO7 ESP32_PINMUX(7, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO8 ESP32_PINMUX(8, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO9 ESP32_PINMUX(9, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO10 ESP32_PINMUX(10, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO11 ESP32_PINMUX(11, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO12 ESP32_PINMUX(12, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO13 ESP32_PINMUX(13, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO14 ESP32_PINMUX(14, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO15 ESP32_PINMUX(15, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO16 ESP32_PINMUX(16, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO17 ESP32_PINMUX(17, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO18 ESP32_PINMUX(18, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO19 ESP32_PINMUX(19, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO20 ESP32_PINMUX(20, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO21 ESP32_PINMUX(21, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO26 ESP32_PINMUX(26, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO27 ESP32_PINMUX(27, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO28 ESP32_PINMUX(28, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO29 ESP32_PINMUX(29, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO30 ESP32_PINMUX(30, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO31 ESP32_PINMUX(31, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO32 ESP32_PINMUX(32, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO33 ESP32_PINMUX(33, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO34 ESP32_PINMUX(34, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO35 ESP32_PINMUX(35, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO36 ESP32_PINMUX(36, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO37 ESP32_PINMUX(37, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO38 ESP32_PINMUX(38, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO39 ESP32_PINMUX(39, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO40 ESP32_PINMUX(40, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO41 ESP32_PINMUX(41, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO42 ESP32_PINMUX(42, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO43 ESP32_PINMUX(43, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO44 ESP32_PINMUX(44, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO45 ESP32_PINMUX(45, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO46 ESP32_PINMUX(46, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
/** @} */

/**
 * @name PCNT3_CH1SIG
 * @{
 */
#define PCNT3_CH1SIG_GPIO0 ESP32_PINMUX(0, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO1 ESP32_PINMUX(1, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO2 ESP32_PINMUX(2, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO3 ESP32_PINMUX(3, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO4 ESP32_PINMUX(4, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO5 ESP32_PINMUX(5, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO6 ESP32_PINMUX(6, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO7 ESP32_PINMUX(7, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO8 ESP32_PINMUX(8, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO9 ESP32_PINMUX(9, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO10 ESP32_PINMUX(10, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO11 ESP32_PINMUX(11, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO12 ESP32_PINMUX(12, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO13 ESP32_PINMUX(13, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO14 ESP32_PINMUX(14, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO15 ESP32_PINMUX(15, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO16 ESP32_PINMUX(16, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO17 ESP32_PINMUX(17, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO18 ESP32_PINMUX(18, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO19 ESP32_PINMUX(19, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO20 ESP32_PINMUX(20, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO21 ESP32_PINMUX(21, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO26 ESP32_PINMUX(26, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO27 ESP32_PINMUX(27, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO28 ESP32_PINMUX(28, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO29 ESP32_PINMUX(29, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO30 ESP32_PINMUX(30, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO31 ESP32_PINMUX(31, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO32 ESP32_PINMUX(32, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO33 ESP32_PINMUX(33, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO34 ESP32_PINMUX(34, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO35 ESP32_PINMUX(35, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO36 ESP32_PINMUX(36, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO37 ESP32_PINMUX(37, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO38 ESP32_PINMUX(38, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO39 ESP32_PINMUX(39, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO40 ESP32_PINMUX(40, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO41 ESP32_PINMUX(41, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO42 ESP32_PINMUX(42, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO43 ESP32_PINMUX(43, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO44 ESP32_PINMUX(44, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO45 ESP32_PINMUX(45, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO46 ESP32_PINMUX(46, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
/** @} */

/**
 * @name RMT_IN0
 * @{
 */
#define RMT_IN0_GPIO0  ESP32_PINMUX(0, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO1  ESP32_PINMUX(1, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO2  ESP32_PINMUX(2, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO3  ESP32_PINMUX(3, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO4  ESP32_PINMUX(4, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO5  ESP32_PINMUX(5, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO6  ESP32_PINMUX(6, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO7  ESP32_PINMUX(7, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO8  ESP32_PINMUX(8, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO9  ESP32_PINMUX(9, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO10 ESP32_PINMUX(10, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO11 ESP32_PINMUX(11, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO12 ESP32_PINMUX(12, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO13 ESP32_PINMUX(13, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO14 ESP32_PINMUX(14, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO15 ESP32_PINMUX(15, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO16 ESP32_PINMUX(16, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO17 ESP32_PINMUX(17, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO18 ESP32_PINMUX(18, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO19 ESP32_PINMUX(19, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO20 ESP32_PINMUX(20, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO21 ESP32_PINMUX(21, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO26 ESP32_PINMUX(26, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO27 ESP32_PINMUX(27, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO28 ESP32_PINMUX(28, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO29 ESP32_PINMUX(29, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO30 ESP32_PINMUX(30, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO31 ESP32_PINMUX(31, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO32 ESP32_PINMUX(32, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO33 ESP32_PINMUX(33, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO34 ESP32_PINMUX(34, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO35 ESP32_PINMUX(35, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO36 ESP32_PINMUX(36, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO37 ESP32_PINMUX(37, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO38 ESP32_PINMUX(38, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO39 ESP32_PINMUX(39, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO40 ESP32_PINMUX(40, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO41 ESP32_PINMUX(41, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO42 ESP32_PINMUX(42, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO43 ESP32_PINMUX(43, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO44 ESP32_PINMUX(44, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO45 ESP32_PINMUX(45, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO46 ESP32_PINMUX(46, ESP_RMT_SIG_IN0, ESP_NOSIG)
/** @} */

/**
 * @name RMT_IN1
 * @{
 */
#define RMT_IN1_GPIO0  ESP32_PINMUX(0, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO1  ESP32_PINMUX(1, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO2  ESP32_PINMUX(2, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO3  ESP32_PINMUX(3, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO4  ESP32_PINMUX(4, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO5  ESP32_PINMUX(5, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO6  ESP32_PINMUX(6, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO7  ESP32_PINMUX(7, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO8  ESP32_PINMUX(8, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO9  ESP32_PINMUX(9, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO10 ESP32_PINMUX(10, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO11 ESP32_PINMUX(11, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO12 ESP32_PINMUX(12, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO13 ESP32_PINMUX(13, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO14 ESP32_PINMUX(14, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO15 ESP32_PINMUX(15, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO16 ESP32_PINMUX(16, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO17 ESP32_PINMUX(17, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO18 ESP32_PINMUX(18, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO19 ESP32_PINMUX(19, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO20 ESP32_PINMUX(20, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO21 ESP32_PINMUX(21, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO26 ESP32_PINMUX(26, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO27 ESP32_PINMUX(27, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO28 ESP32_PINMUX(28, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO29 ESP32_PINMUX(29, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO30 ESP32_PINMUX(30, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO31 ESP32_PINMUX(31, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO32 ESP32_PINMUX(32, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO33 ESP32_PINMUX(33, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO34 ESP32_PINMUX(34, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO35 ESP32_PINMUX(35, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO36 ESP32_PINMUX(36, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO37 ESP32_PINMUX(37, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO38 ESP32_PINMUX(38, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO39 ESP32_PINMUX(39, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO40 ESP32_PINMUX(40, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO41 ESP32_PINMUX(41, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO42 ESP32_PINMUX(42, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO43 ESP32_PINMUX(43, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO44 ESP32_PINMUX(44, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO45 ESP32_PINMUX(45, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO46 ESP32_PINMUX(46, ESP_RMT_SIG_IN1, ESP_NOSIG)
/** @} */

/**
 * @name RMT_IN2
 * @{
 */
#define RMT_IN2_GPIO0  ESP32_PINMUX(0, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO1  ESP32_PINMUX(1, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO2  ESP32_PINMUX(2, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO3  ESP32_PINMUX(3, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO4  ESP32_PINMUX(4, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO5  ESP32_PINMUX(5, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO6  ESP32_PINMUX(6, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO7  ESP32_PINMUX(7, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO8  ESP32_PINMUX(8, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO9  ESP32_PINMUX(9, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO10 ESP32_PINMUX(10, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO11 ESP32_PINMUX(11, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO12 ESP32_PINMUX(12, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO13 ESP32_PINMUX(13, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO14 ESP32_PINMUX(14, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO15 ESP32_PINMUX(15, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO16 ESP32_PINMUX(16, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO17 ESP32_PINMUX(17, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO18 ESP32_PINMUX(18, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO19 ESP32_PINMUX(19, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO20 ESP32_PINMUX(20, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO21 ESP32_PINMUX(21, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO26 ESP32_PINMUX(26, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO27 ESP32_PINMUX(27, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO28 ESP32_PINMUX(28, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO29 ESP32_PINMUX(29, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO30 ESP32_PINMUX(30, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO31 ESP32_PINMUX(31, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO32 ESP32_PINMUX(32, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO33 ESP32_PINMUX(33, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO34 ESP32_PINMUX(34, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO35 ESP32_PINMUX(35, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO36 ESP32_PINMUX(36, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO37 ESP32_PINMUX(37, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO38 ESP32_PINMUX(38, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO39 ESP32_PINMUX(39, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO40 ESP32_PINMUX(40, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO41 ESP32_PINMUX(41, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO42 ESP32_PINMUX(42, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO43 ESP32_PINMUX(43, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO44 ESP32_PINMUX(44, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO45 ESP32_PINMUX(45, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO46 ESP32_PINMUX(46, ESP_RMT_SIG_IN2, ESP_NOSIG)
/** @} */

/**
 * @name RMT_IN3
 * @{
 */
#define RMT_IN3_GPIO0  ESP32_PINMUX(0, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO1  ESP32_PINMUX(1, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO2  ESP32_PINMUX(2, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO3  ESP32_PINMUX(3, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO4  ESP32_PINMUX(4, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO5  ESP32_PINMUX(5, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO6  ESP32_PINMUX(6, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO7  ESP32_PINMUX(7, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO8  ESP32_PINMUX(8, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO9  ESP32_PINMUX(9, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO10 ESP32_PINMUX(10, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO11 ESP32_PINMUX(11, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO12 ESP32_PINMUX(12, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO13 ESP32_PINMUX(13, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO14 ESP32_PINMUX(14, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO15 ESP32_PINMUX(15, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO16 ESP32_PINMUX(16, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO17 ESP32_PINMUX(17, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO18 ESP32_PINMUX(18, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO19 ESP32_PINMUX(19, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO20 ESP32_PINMUX(20, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO21 ESP32_PINMUX(21, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO26 ESP32_PINMUX(26, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO27 ESP32_PINMUX(27, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO28 ESP32_PINMUX(28, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO29 ESP32_PINMUX(29, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO30 ESP32_PINMUX(30, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO31 ESP32_PINMUX(31, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO32 ESP32_PINMUX(32, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO33 ESP32_PINMUX(33, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO34 ESP32_PINMUX(34, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO35 ESP32_PINMUX(35, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO36 ESP32_PINMUX(36, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO37 ESP32_PINMUX(37, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO38 ESP32_PINMUX(38, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO39 ESP32_PINMUX(39, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO40 ESP32_PINMUX(40, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO41 ESP32_PINMUX(41, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO42 ESP32_PINMUX(42, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO43 ESP32_PINMUX(43, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO44 ESP32_PINMUX(44, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO45 ESP32_PINMUX(45, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO46 ESP32_PINMUX(46, ESP_RMT_SIG_IN3, ESP_NOSIG)
/** @} */

/**
 * @name RMT_OUT0
 * @{
 */
#define RMT_OUT0_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO30 ESP32_PINMUX(30, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO31 ESP32_PINMUX(31, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO34 ESP32_PINMUX(34, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO35 ESP32_PINMUX(35, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO36 ESP32_PINMUX(36, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO37 ESP32_PINMUX(37, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO38 ESP32_PINMUX(38, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO39 ESP32_PINMUX(39, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO40 ESP32_PINMUX(40, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO41 ESP32_PINMUX(41, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO42 ESP32_PINMUX(42, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO43 ESP32_PINMUX(43, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO44 ESP32_PINMUX(44, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO45 ESP32_PINMUX(45, ESP_NOSIG, ESP_RMT_SIG_OUT0)
/** @} */

