zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/pinctrl/esp32s2-pinctrl.h
/**
 * @name RMT_OUT1
 * @{
 */
#define RMT_OUT1_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO30 ESP32_PINMUX(30, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO31 ESP32_PINMUX(31, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO34 ESP32_PINMUX(34, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO35 ESP32_PINMUX(35, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO36 ESP32_PINMUX(36, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO37 ESP32_PINMUX(37, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO38 ESP32_PINMUX(38, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO39 ESP32_PINMUX(39, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO40 ESP32_PINMUX(40, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO41 ESP32_PINMUX(41, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO42 ESP32_PINMUX(42, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO43 ESP32_PINMUX(43, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO44 ESP32_PINMUX(44, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO45 ESP32_PINMUX(45, ESP_NOSIG, ESP_RMT_SIG_OUT1)
/** @} */

/**
 * @name RMT_OUT2
 * @{
 */
#define RMT_OUT2_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO30 ESP32_PINMUX(30, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO31 ESP32_PINMUX(31, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO34 ESP32_PINMUX(34, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO35 ESP32_PINMUX(35, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO36 ESP32_PINMUX(36, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO37 ESP32_PINMUX(37, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO38 ESP32_PINMUX(38, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO39 ESP32_PINMUX(39, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO40 ESP32_PINMUX(40, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO41 ESP32_PINMUX(41, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO42 ESP32_PINMUX(42, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO43 ESP32_PINMUX(43, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO44 ESP32_PINMUX(44, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO45 ESP32_PINMUX(45, ESP_NOSIG, ESP_RMT_SIG_OUT2)
/** @} */

/**
 * @name RMT_OUT3
 * @{
 */
#define RMT_OUT3_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO30 ESP32_PINMUX(30, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO31 ESP32_PINMUX(31, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO34 ESP32_PINMUX(34, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO35 ESP32_PINMUX(35, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO36 ESP32_PINMUX(36, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO37 ESP32_PINMUX(37, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO38 ESP32_PINMUX(38, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO39 ESP32_PINMUX(39, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO40 ESP32_PINMUX(40, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO41 ESP32_PINMUX(41, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO42 ESP32_PINMUX(42, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO43 ESP32_PINMUX(43, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO44 ESP32_PINMUX(44, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO45 ESP32_PINMUX(45, ESP_NOSIG, ESP_RMT_SIG_OUT3)
/** @} */

/**
 * @name SPIM2_CSEL
 * @{
 */
#define SPIM2_CSEL_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO30 ESP32_PINMUX(30, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO31 ESP32_PINMUX(31, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO34 ESP32_PINMUX(34, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO35 ESP32_PINMUX(35, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO36 ESP32_PINMUX(36, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO37 ESP32_PINMUX(37, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO38 ESP32_PINMUX(38, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO39 ESP32_PINMUX(39, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO40 ESP32_PINMUX(40, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO41 ESP32_PINMUX(41, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO42 ESP32_PINMUX(42, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO43 ESP32_PINMUX(43, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO44 ESP32_PINMUX(44, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO45 ESP32_PINMUX(45, ESP_NOSIG, ESP_FSPICS0_OUT)
/** @} */

/**
 * @name SPIM2_CSEL1
 * @{
 */
#define SPIM2_CSEL1_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO30 ESP32_PINMUX(30, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO31 ESP32_PINMUX(31, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO34 ESP32_PINMUX(34, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO35 ESP32_PINMUX(35, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO36 ESP32_PINMUX(36, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO37 ESP32_PINMUX(37, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO38 ESP32_PINMUX(38, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO39 ESP32_PINMUX(39, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO40 ESP32_PINMUX(40, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO41 ESP32_PINMUX(41, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO42 ESP32_PINMUX(42, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO43 ESP32_PINMUX(43, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO44 ESP32_PINMUX(44, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO45 ESP32_PINMUX(45, ESP_NOSIG, ESP_FSPICS1_OUT)
/** @} */

/**
 * @name SPIM2_CSEL2
 * @{
 */
#define SPIM2_CSEL2_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO30 ESP32_PINMUX(30, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO31 ESP32_PINMUX(31, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO34 ESP32_PINMUX(34, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO35 ESP32_PINMUX(35, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO36 ESP32_PINMUX(36, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO37 ESP32_PINMUX(37, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO38 ESP32_PINMUX(38, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO39 ESP32_PINMUX(39, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO40 ESP32_PINMUX(40, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO41 ESP32_PINMUX(41, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO42 ESP32_PINMUX(42, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO43 ESP32_PINMUX(43, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO44 ESP32_PINMUX(44, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO45 ESP32_PINMUX(45, ESP_NOSIG, ESP_FSPICS2_OUT)
/** @} */

/**
 * @name SPIM2_CSEL3
 * @{
 */
#define SPIM2_CSEL3_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO30 ESP32_PINMUX(30, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO31 ESP32_PINMUX(31, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO34 ESP32_PINMUX(34, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO35 ESP32_PINMUX(35, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO36 ESP32_PINMUX(36, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO37 ESP32_PINMUX(37, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO38 ESP32_PINMUX(38, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO39 ESP32_PINMUX(39, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO40 ESP32_PINMUX(40, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO41 ESP32_PINMUX(41, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO42 ESP32_PINMUX(42, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO43 ESP32_PINMUX(43, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO44 ESP32_PINMUX(44, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO45 ESP32_PINMUX(45, ESP_NOSIG, ESP_FSPICS3_OUT)
/** @} */

