zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/pinctrl/esp32s2-pinctrl.h
/**
 * @name SPIM3_CSEL2
 * @{
 */
#define SPIM3_CSEL2_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_SPI3_CS2_OUT)
#define SPIM3_CSEL2_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_SPI3_CS2_OUT)
#define SPIM3_CSEL2_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_SPI3_CS2_OUT)
#define SPIM3_CSEL2_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_SPI3_CS2_OUT)
#define SPIM3_CSEL2_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_SPI3_CS2_OUT)
#define SPIM3_CSEL2_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_SPI3_CS2_OUT)
#define SPIM3_CSEL2_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_SPI3_CS2_OUT)
#define SPIM3_CSEL2_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_SPI3_CS2_OUT)
#define SPIM3_CSEL2_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_SPI3_CS2_OUT)
#define SPIM3_CSEL2_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_SPI3_CS2_OUT)
#define SPIM3_CSEL2_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_SPI3_CS2_OUT)
#define SPIM3_CSEL2_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_SPI3_CS2_OUT)
#define SPIM3_CSEL2_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_SPI3_CS2_OUT)
#define SPIM3_CSEL2_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_SPI3_CS2_OUT)
#define SPIM3_CSEL2_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_SPI3_CS2_OUT)
#define SPIM3_CSEL2_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_SPI3_CS2_OUT)
#define SPIM3_CSEL2_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_SPI3_CS2_OUT)
#define SPIM3_CSEL2_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_SPI3_CS2_OUT)
#define SPIM3_CSEL2_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_SPI3_CS2_OUT)
#define SPIM3_CSEL2_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_SPI3_CS2_OUT)
#define SPIM3_CSEL2_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_SPI3_CS2_OUT)
#define SPIM3_CSEL2_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_SPI3_CS2_OUT)
#define SPIM3_CSEL2_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_SPI3_CS2_OUT)
#define SPIM3_CSEL2_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_SPI3_CS2_OUT)
#define SPIM3_CSEL2_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_SPI3_CS2_OUT)
#define SPIM3_CSEL2_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_SPI3_CS2_OUT)
#define SPIM3_CSEL2_GPIO30 ESP32_PINMUX(30, ESP_NOSIG, ESP_SPI3_CS2_OUT)
#define SPIM3_CSEL2_GPIO31 ESP32_PINMUX(31, ESP_NOSIG, ESP_SPI3_CS2_OUT)
#define SPIM3_CSEL2_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_SPI3_CS2_OUT)
#define SPIM3_CSEL2_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_SPI3_CS2_OUT)
#define SPIM3_CSEL2_GPIO34 ESP32_PINMUX(34, ESP_NOSIG, ESP_SPI3_CS2_OUT)
#define SPIM3_CSEL2_GPIO35 ESP32_PINMUX(35, ESP_NOSIG, ESP_SPI3_CS2_OUT)
#define SPIM3_CSEL2_GPIO36 ESP32_PINMUX(36, ESP_NOSIG, ESP_SPI3_CS2_OUT)
#define SPIM3_CSEL2_GPIO37 ESP32_PINMUX(37, ESP_NOSIG, ESP_SPI3_CS2_OUT)
#define SPIM3_CSEL2_GPIO38 ESP32_PINMUX(38, ESP_NOSIG, ESP_SPI3_CS2_OUT)
#define SPIM3_CSEL2_GPIO39 ESP32_PINMUX(39, ESP_NOSIG, ESP_SPI3_CS2_OUT)
#define SPIM3_CSEL2_GPIO40 ESP32_PINMUX(40, ESP_NOSIG, ESP_SPI3_CS2_OUT)
#define SPIM3_CSEL2_GPIO41 ESP32_PINMUX(41, ESP_NOSIG, ESP_SPI3_CS2_OUT)
#define SPIM3_CSEL2_GPIO42 ESP32_PINMUX(42, ESP_NOSIG, ESP_SPI3_CS2_OUT)
#define SPIM3_CSEL2_GPIO43 ESP32_PINMUX(43, ESP_NOSIG, ESP_SPI3_CS2_OUT)
#define SPIM3_CSEL2_GPIO44 ESP32_PINMUX(44, ESP_NOSIG, ESP_SPI3_CS2_OUT)
#define SPIM3_CSEL2_GPIO45 ESP32_PINMUX(45, ESP_NOSIG, ESP_SPI3_CS2_OUT)
/** @} */

/**
 * @name SPIM3_MISO
 * @{
 */
#define SPIM3_MISO_GPIO0 ESP32_PINMUX(0, ESP_SPI3_Q_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO1 ESP32_PINMUX(1, ESP_SPI3_Q_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO2 ESP32_PINMUX(2, ESP_SPI3_Q_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO3 ESP32_PINMUX(3, ESP_SPI3_Q_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO4 ESP32_PINMUX(4, ESP_SPI3_Q_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO5 ESP32_PINMUX(5, ESP_SPI3_Q_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO6 ESP32_PINMUX(6, ESP_SPI3_Q_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO7 ESP32_PINMUX(7, ESP_SPI3_Q_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO8 ESP32_PINMUX(8, ESP_SPI3_Q_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO9 ESP32_PINMUX(9, ESP_SPI3_Q_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO10 ESP32_PINMUX(10, ESP_SPI3_Q_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO11 ESP32_PINMUX(11, ESP_SPI3_Q_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO12 ESP32_PINMUX(12, ESP_SPI3_Q_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO13 ESP32_PINMUX(13, ESP_SPI3_Q_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO14 ESP32_PINMUX(14, ESP_SPI3_Q_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO15 ESP32_PINMUX(15, ESP_SPI3_Q_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO16 ESP32_PINMUX(16, ESP_SPI3_Q_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO17 ESP32_PINMUX(17, ESP_SPI3_Q_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO18 ESP32_PINMUX(18, ESP_SPI3_Q_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO19 ESP32_PINMUX(19, ESP_SPI3_Q_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO20 ESP32_PINMUX(20, ESP_SPI3_Q_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO21 ESP32_PINMUX(21, ESP_SPI3_Q_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO26 ESP32_PINMUX(26, ESP_SPI3_Q_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO27 ESP32_PINMUX(27, ESP_SPI3_Q_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO28 ESP32_PINMUX(28, ESP_SPI3_Q_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO29 ESP32_PINMUX(29, ESP_SPI3_Q_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO30 ESP32_PINMUX(30, ESP_SPI3_Q_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO31 ESP32_PINMUX(31, ESP_SPI3_Q_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO32 ESP32_PINMUX(32, ESP_SPI3_Q_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO33 ESP32_PINMUX(33, ESP_SPI3_Q_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO34 ESP32_PINMUX(34, ESP_SPI3_Q_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO35 ESP32_PINMUX(35, ESP_SPI3_Q_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO36 ESP32_PINMUX(36, ESP_SPI3_Q_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO37 ESP32_PINMUX(37, ESP_SPI3_Q_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO38 ESP32_PINMUX(38, ESP_SPI3_Q_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO39 ESP32_PINMUX(39, ESP_SPI3_Q_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO40 ESP32_PINMUX(40, ESP_SPI3_Q_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO41 ESP32_PINMUX(41, ESP_SPI3_Q_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO42 ESP32_PINMUX(42, ESP_SPI3_Q_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO43 ESP32_PINMUX(43, ESP_SPI3_Q_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO44 ESP32_PINMUX(44, ESP_SPI3_Q_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO45 ESP32_PINMUX(45, ESP_SPI3_Q_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO46 ESP32_PINMUX(46, ESP_SPI3_Q_IN, ESP_NOSIG)
/** @} */

/**
 * @name SPIM3_MOSI
 * @{
 */
#define SPIM3_MOSI_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_SPI3_D_OUT)
#define SPIM3_MOSI_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_SPI3_D_OUT)
#define SPIM3_MOSI_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_SPI3_D_OUT)
#define SPIM3_MOSI_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_SPI3_D_OUT)
#define SPIM3_MOSI_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_SPI3_D_OUT)
#define SPIM3_MOSI_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_SPI3_D_OUT)
#define SPIM3_MOSI_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_SPI3_D_OUT)
#define SPIM3_MOSI_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_SPI3_D_OUT)
#define SPIM3_MOSI_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_SPI3_D_OUT)
#define SPIM3_MOSI_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_SPI3_D_OUT)
#define SPIM3_MOSI_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_SPI3_D_OUT)
#define SPIM3_MOSI_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_SPI3_D_OUT)
#define SPIM3_MOSI_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_SPI3_D_OUT)
#define SPIM3_MOSI_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_SPI3_D_OUT)
#define SPIM3_MOSI_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_SPI3_D_OUT)
#define SPIM3_MOSI_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_SPI3_D_OUT)
#define SPIM3_MOSI_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_SPI3_D_OUT)
#define SPIM3_MOSI_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_SPI3_D_OUT)
#define SPIM3_MOSI_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_SPI3_D_OUT)
#define SPIM3_MOSI_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_SPI3_D_OUT)
#define SPIM3_MOSI_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_SPI3_D_OUT)
#define SPIM3_MOSI_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_SPI3_D_OUT)
#define SPIM3_MOSI_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_SPI3_D_OUT)
#define SPIM3_MOSI_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_SPI3_D_OUT)
#define SPIM3_MOSI_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_SPI3_D_OUT)
#define SPIM3_MOSI_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_SPI3_D_OUT)
#define SPIM3_MOSI_GPIO30 ESP32_PINMUX(30, ESP_NOSIG, ESP_SPI3_D_OUT)
#define SPIM3_MOSI_GPIO31 ESP32_PINMUX(31, ESP_NOSIG, ESP_SPI3_D_OUT)
#define SPIM3_MOSI_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_SPI3_D_OUT)
#define SPIM3_MOSI_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_SPI3_D_OUT)
#define SPIM3_MOSI_GPIO34 ESP32_PINMUX(34, ESP_NOSIG, ESP_SPI3_D_OUT)
#define SPIM3_MOSI_GPIO35 ESP32_PINMUX(35, ESP_NOSIG, ESP_SPI3_D_OUT)
#define SPIM3_MOSI_GPIO36 ESP32_PINMUX(36, ESP_NOSIG, ESP_SPI3_D_OUT)
#define SPIM3_MOSI_GPIO37 ESP32_PINMUX(37, ESP_NOSIG, ESP_SPI3_D_OUT)
#define SPIM3_MOSI_GPIO38 ESP32_PINMUX(38, ESP_NOSIG, ESP_SPI3_D_OUT)
#define SPIM3_MOSI_GPIO39 ESP32_PINMUX(39, ESP_NOSIG, ESP_SPI3_D_OUT)
#define SPIM3_MOSI_GPIO40 ESP32_PINMUX(40, ESP_NOSIG, ESP_SPI3_D_OUT)
#define SPIM3_MOSI_GPIO41 ESP32_PINMUX(41, ESP_NOSIG, ESP_SPI3_D_OUT)
#define SPIM3_MOSI_GPIO42 ESP32_PINMUX(42, ESP_NOSIG, ESP_SPI3_D_OUT)
#define SPIM3_MOSI_GPIO43 ESP32_PINMUX(43, ESP_NOSIG, ESP_SPI3_D_OUT)
#define SPIM3_MOSI_GPIO44 ESP32_PINMUX(44, ESP_NOSIG, ESP_SPI3_D_OUT)
#define SPIM3_MOSI_GPIO45 ESP32_PINMUX(45, ESP_NOSIG, ESP_SPI3_D_OUT)
/** @} */

/**
 * @name SPIM3_SCLK
 * @{
 */
#define SPIM3_SCLK_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_SPI3_CLK_OUT_MUX)
#define SPIM3_SCLK_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_SPI3_CLK_OUT_MUX)
#define SPIM3_SCLK_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_SPI3_CLK_OUT_MUX)
#define SPIM3_SCLK_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_SPI3_CLK_OUT_MUX)
#define SPIM3_SCLK_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_SPI3_CLK_OUT_MUX)
#define SPIM3_SCLK_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_SPI3_CLK_OUT_MUX)
#define SPIM3_SCLK_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_SPI3_CLK_OUT_MUX)
#define SPIM3_SCLK_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_SPI3_CLK_OUT_MUX)
#define SPIM3_SCLK_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_SPI3_CLK_OUT_MUX)
#define SPIM3_SCLK_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_SPI3_CLK_OUT_MUX)
#define SPIM3_SCLK_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_SPI3_CLK_OUT_MUX)
#define SPIM3_SCLK_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_SPI3_CLK_OUT_MUX)
#define SPIM3_SCLK_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_SPI3_CLK_OUT_MUX)
#define SPIM3_SCLK_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_SPI3_CLK_OUT_MUX)
#define SPIM3_SCLK_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_SPI3_CLK_OUT_MUX)
#define SPIM3_SCLK_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_SPI3_CLK_OUT_MUX)
#define SPIM3_SCLK_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_SPI3_CLK_OUT_MUX)
#define SPIM3_SCLK_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_SPI3_CLK_OUT_MUX)
#define SPIM3_SCLK_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_SPI3_CLK_OUT_MUX)
#define SPIM3_SCLK_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_SPI3_CLK_OUT_MUX)
#define SPIM3_SCLK_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_SPI3_CLK_OUT_MUX)
#define SPIM3_SCLK_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_SPI3_CLK_OUT_MUX)
#define SPIM3_SCLK_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_SPI3_CLK_OUT_MUX)
#define SPIM3_SCLK_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_SPI3_CLK_OUT_MUX)
#define SPIM3_SCLK_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_SPI3_CLK_OUT_MUX)
#define SPIM3_SCLK_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_SPI3_CLK_OUT_MUX)
#define SPIM3_SCLK_GPIO30 ESP32_PINMUX(30, ESP_NOSIG, ESP_SPI3_CLK_OUT_MUX)
#define SPIM3_SCLK_GPIO31 ESP32_PINMUX(31, ESP_NOSIG, ESP_SPI3_CLK_OUT_MUX)
#define SPIM3_SCLK_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_SPI3_CLK_OUT_MUX)
#define SPIM3_SCLK_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_SPI3_CLK_OUT_MUX)
#define SPIM3_SCLK_GPIO34 ESP32_PINMUX(34, ESP_NOSIG, ESP_SPI3_CLK_OUT_MUX)
#define SPIM3_SCLK_GPIO35 ESP32_PINMUX(35, ESP_NOSIG, ESP_SPI3_CLK_OUT_MUX)
#define SPIM3_SCLK_GPIO36 ESP32_PINMUX(36, ESP_NOSIG, ESP_SPI3_CLK_OUT_MUX)
#define SPIM3_SCLK_GPIO37 ESP32_PINMUX(37, ESP_NOSIG, ESP_SPI3_CLK_OUT_MUX)
#define SPIM3_SCLK_GPIO38 ESP32_PINMUX(38, ESP_NOSIG, ESP_SPI3_CLK_OUT_MUX)
#define SPIM3_SCLK_GPIO39 ESP32_PINMUX(39, ESP_NOSIG, ESP_SPI3_CLK_OUT_MUX)
#define SPIM3_SCLK_GPIO40 ESP32_PINMUX(40, ESP_NOSIG, ESP_SPI3_CLK_OUT_MUX)
#define SPIM3_SCLK_GPIO41 ESP32_PINMUX(41, ESP_NOSIG, ESP_SPI3_CLK_OUT_MUX)
#define SPIM3_SCLK_GPIO42 ESP32_PINMUX(42, ESP_NOSIG, ESP_SPI3_CLK_OUT_MUX)
#define SPIM3_SCLK_GPIO43 ESP32_PINMUX(43, ESP_NOSIG, ESP_SPI3_CLK_OUT_MUX)
#define SPIM3_SCLK_GPIO44 ESP32_PINMUX(44, ESP_NOSIG, ESP_SPI3_CLK_OUT_MUX)
#define SPIM3_SCLK_GPIO45 ESP32_PINMUX(45, ESP_NOSIG, ESP_SPI3_CLK_OUT_MUX)
/** @} */

/**
 * @name TWAI_BUS_OFF
 * @{
 */
#define TWAI_BUS_OFF_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_TWAI_BUS_OFF_ON)
#define TWAI_BUS_OFF_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_TWAI_BUS_OFF_ON)
#define TWAI_BUS_OFF_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_TWAI_BUS_OFF_ON)
#define TWAI_BUS_OFF_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_TWAI_BUS_OFF_ON)
#define TWAI_BUS_OFF_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_TWAI_BUS_OFF_ON)
#define TWAI_BUS_OFF_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_TWAI_BUS_OFF_ON)
#define TWAI_BUS_OFF_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_TWAI_BUS_OFF_ON)
#define TWAI_BUS_OFF_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_TWAI_BUS_OFF_ON)
#define TWAI_BUS_OFF_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_TWAI_BUS_OFF_ON)
#define TWAI_BUS_OFF_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_TWAI_BUS_OFF_ON)
#define TWAI_BUS_OFF_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_TWAI_BUS_OFF_ON)
#define TWAI_BUS_OFF_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_TWAI_BUS_OFF_ON)
#define TWAI_BUS_OFF_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_TWAI_BUS_OFF_ON)
#define TWAI_BUS_OFF_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_TWAI_BUS_OFF_ON)
#define TWAI_BUS_OFF_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_TWAI_BUS_OFF_ON)
#define TWAI_BUS_OFF_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_TWAI_BUS_OFF_ON)
#define TWAI_BUS_OFF_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_TWAI_BUS_OFF_ON)
#define TWAI_BUS_OFF_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_TWAI_BUS_OFF_ON)
#define TWAI_BUS_OFF_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_TWAI_BUS_OFF_ON)
#define TWAI_BUS_OFF_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_TWAI_BUS_OFF_ON)
#define TWAI_BUS_OFF_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_TWAI_BUS_OFF_ON)
#define TWAI_BUS_OFF_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_TWAI_BUS_OFF_ON)
#define TWAI_BUS_OFF_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_TWAI_BUS_OFF_ON)
#define TWAI_BUS_OFF_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_TWAI_BUS_OFF_ON)
#define TWAI_BUS_OFF_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_TWAI_BUS_OFF_ON)
#define TWAI_BUS_OFF_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_TWAI_BUS_OFF_ON)
#define TWAI_BUS_OFF_GPIO30 ESP32_PINMUX(30, ESP_NOSIG, ESP_TWAI_BUS_OFF_ON)
#define TWAI_BUS_OFF_GPIO31 ESP32_PINMUX(31, ESP_NOSIG, ESP_TWAI_BUS_OFF_ON)
#define TWAI_BUS_OFF_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_TWAI_BUS_OFF_ON)
#define TWAI_BUS_OFF_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_TWAI_BUS_OFF_ON)
#define TWAI_BUS_OFF_GPIO34 ESP32_PINMUX(34, ESP_NOSIG, ESP_TWAI_BUS_OFF_ON)
#define TWAI_BUS_OFF_GPIO35 ESP32_PINMUX(35, ESP_NOSIG, ESP_TWAI_BUS_OFF_ON)
#define TWAI_BUS_OFF_GPIO36 ESP32_PINMUX(36, ESP_NOSIG, ESP_TWAI_BUS_OFF_ON)
#define TWAI_BUS_OFF_GPIO37 ESP32_PINMUX(37, ESP_NOSIG, ESP_TWAI_BUS_OFF_ON)
#define TWAI_BUS_OFF_GPIO38 ESP32_PINMUX(38, ESP_NOSIG, ESP_TWAI_BUS_OFF_ON)
#define TWAI_BUS_OFF_GPIO39 ESP32_PINMUX(39, ESP_NOSIG, ESP_TWAI_BUS_OFF_ON)
#define TWAI_BUS_OFF_GPIO40 ESP32_PINMUX(40, ESP_NOSIG, ESP_TWAI_BUS_OFF_ON)
#define TWAI_BUS_OFF_GPIO41 ESP32_PINMUX(41, ESP_NOSIG, ESP_TWAI_BUS_OFF_ON)
#define TWAI_BUS_OFF_GPIO42 ESP32_PINMUX(42, ESP_NOSIG, ESP_TWAI_BUS_OFF_ON)
#define TWAI_BUS_OFF_GPIO43 ESP32_PINMUX(43, ESP_NOSIG, ESP_TWAI_BUS_OFF_ON)
#define TWAI_BUS_OFF_GPIO44 ESP32_PINMUX(44, ESP_NOSIG, ESP_TWAI_BUS_OFF_ON)
#define TWAI_BUS_OFF_GPIO45 ESP32_PINMUX(45, ESP_NOSIG, ESP_TWAI_BUS_OFF_ON)
/** @} */

/**
 * @name TWAI_CLKOUT
 * @{
 */
#define TWAI_CLKOUT_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_TWAI_CLKOUT)
#define TWAI_CLKOUT_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_TWAI_CLKOUT)
#define TWAI_CLKOUT_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_TWAI_CLKOUT)
#define TWAI_CLKOUT_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_TWAI_CLKOUT)
#define TWAI_CLKOUT_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_TWAI_CLKOUT)
#define TWAI_CLKOUT_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_TWAI_CLKOUT)
#define TWAI_CLKOUT_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_TWAI_CLKOUT)
#define TWAI_CLKOUT_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_TWAI_CLKOUT)
#define TWAI_CLKOUT_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_TWAI_CLKOUT)
#define TWAI_CLKOUT_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_TWAI_CLKOUT)
#define TWAI_CLKOUT_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_TWAI_CLKOUT)
#define TWAI_CLKOUT_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_TWAI_CLKOUT)
#define TWAI_CLKOUT_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_TWAI_CLKOUT)
#define TWAI_CLKOUT_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_TWAI_CLKOUT)
#define TWAI_CLKOUT_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_TWAI_CLKOUT)
#define TWAI_CLKOUT_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_TWAI_CLKOUT)
#define TWAI_CLKOUT_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_TWAI_CLKOUT)
#define TWAI_CLKOUT_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_TWAI_CLKOUT)
#define TWAI_CLKOUT_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_TWAI_CLKOUT)
#define TWAI_CLKOUT_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_TWAI_CLKOUT)
#define TWAI_CLKOUT_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_TWAI_CLKOUT)
#define TWAI_CLKOUT_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_TWAI_CLKOUT)
#define TWAI_CLKOUT_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_TWAI_CLKOUT)
#define TWAI_CLKOUT_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_TWAI_CLKOUT)
#define TWAI_CLKOUT_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_TWAI_CLKOUT)
#define TWAI_CLKOUT_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_TWAI_CLKOUT)
#define TWAI_CLKOUT_GPIO30 ESP32_PINMUX(30, ESP_NOSIG, ESP_TWAI_CLKOUT)
#define TWAI_CLKOUT_GPIO31 ESP32_PINMUX(31, ESP_NOSIG, ESP_TWAI_CLKOUT)
#define TWAI_CLKOUT_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_TWAI_CLKOUT)
#define TWAI_CLKOUT_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_TWAI_CLKOUT)
#define TWAI_CLKOUT_GPIO34 ESP32_PINMUX(34, ESP_NOSIG, ESP_TWAI_CLKOUT)
#define TWAI_CLKOUT_GPIO35 ESP32_PINMUX(35, ESP_NOSIG, ESP_TWAI_CLKOUT)
#define TWAI_CLKOUT_GPIO36 ESP32_PINMUX(36, ESP_NOSIG, ESP_TWAI_CLKOUT)
#define TWAI_CLKOUT_GPIO37 ESP32_PINMUX(37, ESP_NOSIG, ESP_TWAI_CLKOUT)
#define TWAI_CLKOUT_GPIO38 ESP32_PINMUX(38, ESP_NOSIG, ESP_TWAI_CLKOUT)
#define TWAI_CLKOUT_GPIO39 ESP32_PINMUX(39, ESP_NOSIG, ESP_TWAI_CLKOUT)
#define TWAI_CLKOUT_GPIO40 ESP32_PINMUX(40, ESP_NOSIG, ESP_TWAI_CLKOUT)
#define TWAI_CLKOUT_GPIO41 ESP32_PINMUX(41, ESP_NOSIG, ESP_TWAI_CLKOUT)
#define TWAI_CLKOUT_GPIO42 ESP32_PINMUX(42, ESP_NOSIG, ESP_TWAI_CLKOUT)
#define TWAI_CLKOUT_GPIO43 ESP32_PINMUX(43, ESP_NOSIG, ESP_TWAI_CLKOUT)
#define TWAI_CLKOUT_GPIO44 ESP32_PINMUX(44, ESP_NOSIG, ESP_TWAI_CLKOUT)
#define TWAI_CLKOUT_GPIO45 ESP32_PINMUX(45, ESP_NOSIG, ESP_TWAI_CLKOUT)
/** @} */

/**
 * @name TWAI_RX
 * @{
 */
#define TWAI_RX_GPIO0 ESP32_PINMUX(0, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO1 ESP32_PINMUX(1, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO2 ESP32_PINMUX(2, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO3 ESP32_PINMUX(3, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO4 ESP32_PINMUX(4, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO5 ESP32_PINMUX(5, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO6 ESP32_PINMUX(6, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO7 ESP32_PINMUX(7, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO8 ESP32_PINMUX(8, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO9 ESP32_PINMUX(9, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO10 ESP32_PINMUX(10, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO11 ESP32_PINMUX(11, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO12 ESP32_PINMUX(12, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO13 ESP32_PINMUX(13, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO14 ESP32_PINMUX(14, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO15 ESP32_PINMUX(15, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO16 ESP32_PINMUX(16, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO17 ESP32_PINMUX(17, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO18 ESP32_PINMUX(18, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO19 ESP32_PINMUX(19, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO20 ESP32_PINMUX(20, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO21 ESP32_PINMUX(21, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO26 ESP32_PINMUX(26, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO27 ESP32_PINMUX(27, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO28 ESP32_PINMUX(28, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO29 ESP32_PINMUX(29, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO30 ESP32_PINMUX(30, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO31 ESP32_PINMUX(31, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO32 ESP32_PINMUX(32, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO33 ESP32_PINMUX(33, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO34 ESP32_PINMUX(34, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO35 ESP32_PINMUX(35, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO36 ESP32_PINMUX(36, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO37 ESP32_PINMUX(37, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO38 ESP32_PINMUX(38, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO39 ESP32_PINMUX(39, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO40 ESP32_PINMUX(40, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO41 ESP32_PINMUX(41, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO42 ESP32_PINMUX(42, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO43 ESP32_PINMUX(43, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO44 ESP32_PINMUX(44, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO45 ESP32_PINMUX(45, ESP_TWAI_RX, ESP_NOSIG)
#define TWAI_RX_GPIO46 ESP32_PINMUX(46, ESP_TWAI_RX, ESP_NOSIG)
/** @} */

